import React, { Component } from 'react';
import { Container , Row , Col } from "react-bootstrap";
import { navigate } from 'gatsby';
import { checkLoggedIn } from '../services/auth/AuthService';

export default class Rules extends Component {

    async componentDidMount() {
        let isLoggedIn = await checkLoggedIn();
        if(isLoggedIn) navigate('/');
    }

    render() {
        return (
            <div className="login bp">
                <Container>
                    <Row>
                        <Col lg={12}>
                            <div className="list">
                                <h1> প্রতিযোগিতার সাধারণ নিয়মাবলীঃ </h1>
                                <ul>
                                    <li>১। লিংকে ক্লিক করুন।</li>
                                    <li>২। নিজের নাম, ফোন নম্বর এবং কনফার্ম ফোন নম্বর প্রদান করুন।</li>
                                    <li>৩। আপনার ডিসপ্লেতে নিয়মাবলী আসবে এবং তার নিচে কুইজ শুরু করার অপশন থাকবে।</li>
                                    <li>৪। স্টার্ট বাটান এ ক্লিক করে খেলা শুরু করুন।</li>
                                    <li>৫। স্টার্ট অপশনে ক্লিক করার সাথে সাথে আপনার সময় শুরু হয়ে যাবে। </li>
                                    <li>৬। প্রতিটি প্রশ্নের সঠিক উত্তর দিয়ে পরের প্রশ্নে যেতে পারবেন।</li>
                                    <li>৭। সঠিক উত্তর ছাড়া পরের প্রশ্নে যাওয়া যাবে না।</li>
                                    <li>৮। ভুল উত্তরের ক্ষেত্রে পুনরায় সঠিক উত্তর দেওার সুযোগ পাবেন।</li>
                                    <li>৯। যে যত তাড়াতাড়ি সঠিক উত্তর দিয়ে খেলা শেষ করতে পারবে, সে লিডারবোর্ডে তত এগিয়ে থাকবে।</li>
                                    <li>১০। সফলভাবে খেলা শেষ হলে প্রতিযোগীকে ’লিডার বোর্ড’ বা সেরার তালিকা দেখানো হবে। সাম্প্রতিক সেরা ৩ জন এবং সারাদিনের সেরা ১০ জনের নাম দেখানো হবে।</li>
                                    <li>১১। প্রতিদিন দশজন বিজয়ীর নাম ঘোষণা হবে। যারা প্রত্যেকে ১ কেস করে স্পিড পাবেন।</li>
                                    <li>১২। প্রতিদিনের এ প্রতিযোগিতা শেষ হবে রাত ১২ টায়।</li>
                                    <li>১৩। পুরো প্রতিযোগিতা শেষে সকল বিজয়ীদের মধ্য থেকে শীর্ষ ৩ জনের নাম ঘোষণা করা হবে।</li>
                                    <li>১৪। প্রতিযোগিতা শেষে  শীর্ষ ৩ জন বিজয়ী পাবে ৩টি স্মার্টফোন।</li>
                                </ul>

                                <h1> শর্তাবলীঃ </h1>
                                <ul>
                                    <li> ১. বিজয়ী নির্ধারণ করা হবে লিডার বোর্ড বা সেরাদের তালিকা থেকে।</li>
                                    <li> ২. প্রতিদিনের ১০ জন বিজয়ী ও শীর্ষ ৩জন বিজয়ীর নাম ফেসবুকে ঘোষণা করা হবে।</li>
                                    <li> ৩. এই প্রতিযোগিতার আয়োজক ও এর সংশ্লিষ্ট কেউ এ প্রতিযোগিতায় অংশগ্রহণ করতে পারবে না।</li>
                                    <li> ৪. প্রতিযোগীকে ব্যক্তিগত সাক্ষাৎকার, ছবি তোলা সংশ্লিষ্ট অন্যান্য কাজে অংশগ্রহণ করতে হতে পারে।</li>
                                    <li> ৫. প্রতিযোগিতা যেকোন সময় স্থগিত অথবা এর নিয়মাবলী পরিবর্তন, পরিবর্ধন এবং পরিমার্জন করার সম্পূর্ণ অধিকার Akij Food and Beverage Ltd. কর্তৃপক্ষ সংরক্ষণ করে।</li>

                                </ul>
                            </div>
                             
                        </Col>
                    </Row>
                </Container>
            </div>
        )
    }
}
